In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Grabbing and Cleaning Data

In [2]:
ghg = pd.read_csv('../p5/data/total-ghg-emissions.csv')
ghg.drop(columns=['Code'], inplace=True)
ghg.rename(columns={"Total GHG emissions including LUCF (CAIT)":"Total GHG"}, inplace=True)
ghg = ghg[ghg['Year']>1989]
ghg = ghg[ghg['Year'] < 2015]
ghg.to_csv('../data/new_cleaned/ghg.csv')
ghg

           Entity  Year   Total GHG
0     Afghanistan  1990  15140000.0
1     Afghanistan  1991  15060000.0
2     Afghanistan  1992  13600000.0
3     Afghanistan  1993  13430000.0
4     Afghanistan  1994  13240000.0
...           ...   ...         ...
5201     Zimbabwe  2010  66540000.0
5202     Zimbabwe  2011  67420000.0
5203     Zimbabwe  2012  67630000.0
5204     Zimbabwe  2013  67550000.0
5205     Zimbabwe  2014  66100000.0

[4822 rows x 3 columns]

In [3]:
airpol_death_share = pd.read_csv('../p5/data/share-deaths-air-pollution.csv')
airpol_death_share.drop(columns=['Code'], inplace=True)
airpol_death_share.rename(columns={"Deaths - Cause: All causes - Risk: Air pollution - Sex: Both - Age: Age-standardized (Percent)": "Deaths %"}, inplace=True)
airpol_death_share = airpol_death_share[airpol_death_share['Year']>1989]
airpol_death_share = airpol_death_share[airpol_death_share['Year'] < 2015]
airpol_death_share.to_csv('../data/new_cleaned/airpol_death_share.csv')
airpol_death_share

           Entity  Year   Deaths %
0     Afghanistan  1990  21.328446
1     Afghanistan  1991  21.011770
2     Afghanistan  1992  21.192810
3     Afghanistan  1993  21.367169
4     Afghanistan  1994  21.094811
...           ...   ...        ...
8180     Zimbabwe  2010   9.450169
8181     Zimbabwe  2011  10.053401
8182     Zimbabwe  2012  10.455091
8183     Zimbabwe  2013  10.691584
8184     Zimbabwe  2014  10.858493

[6825 rows x 3 columns]

In [4]:
airpol = pd.read_csv('../p5/data/PM25-air-pollution.csv')
airpol.drop(columns=['Code'], inplace=True)
airpol.rename(columns={"PM2.5 air pollution, mean annual exposure (micrograms per cubic meter)": "Air Pollution"}, inplace=True)
airpol = airpol[airpol['Year']>1989]
airpol = airpol[airpol['Year'] < 2015]
airpol.to_csv('../data/new_cleaned/airpol.csv')
airpol

           Entity  Year  Air Pollution
0     Afghanistan  1990      65.486792
1     Afghanistan  1995      65.179513
2     Afghanistan  2000      64.922462
3     Afghanistan  2005      64.522683
4     Afghanistan  2010      65.245592
...           ...   ...            ...
2896     Zimbabwe  2010      23.231479
2897     Zimbabwe  2011      23.074213
2898     Zimbabwe  2012      23.198097
2899     Zimbabwe  2013      23.111088
2900     Zimbabwe  2014      22.805950

[2178 rows x 3 columns]

In [5]:
net_zero_binary = pd.read_csv('../p5/data/net-zero-target-set.csv')
net_zero_binary.drop(columns=['Code'], inplace=True)
net_zero_binary.rename(columns={"Is there a net-zero target?":"Net-Zero Target"}, inplace=True)
net_zero_binary.rename(columns={"Year":"Year-Zs"}, inplace=True)
net_zero_binary['Net-Zero Target'] = net_zero_binary['Net-Zero Target'].map({"Yes":1, "No":0})
#net_zero_binary = net_zero_binary[net_zero_binary['Year']>1989]
net_zero_binary.to_csv('../data/new_cleaned/net_zero_binary.csv')
net_zero_binary

                  Entity  Year-Zs  Net-Zero Target
0    Antigua and Barbuda     2040                1
1              Australia     2050                1
2                Austria     2040                1
3                Bahrain     2060                1
4               Barbados     2030                1
..                   ...      ...              ...
61  United Arab Emirates     2050                1
62        United Kingdom     2050                1
63         United States     2050                1
64               Uruguay     2050                1
65               Vietnam     2050                1

[66 rows x 3 columns]

In [6]:
'''
energy_country=pd.read_csv('../p5/data/country-primary-energy.csv')
energy_country.drop(columns=['Code'], inplace=True)
energy_country = energy_country[energy_country['Year']>1989]
energy_country.to_csv('../data/new_cleaned/energy_country.csv')
energy_country = energy_country[energy_country['Entity'] != 'World']
'''

"\nenergy_country=pd.read_csv('../p5/data/country-primary-energy.csv')\nenergy_country.drop(columns=['Code'], inplace=True)\nenergy_country = energy_country[energy_country['Year']>1989]\nenergy_country.to_csv('../data/new_cleaned/energy_country.csv')\nenergy_country = energy_country[energy_country['Entity'] != 'World']\n"

In [7]:
food_co2e = pd.read_csv('../p5/data/emissions-from-food.csv')
food_co2e.drop(columns=['Code'], inplace=True)
food_co2e.rename(columns={"Food emissions by country":"Food Emissions"}, inplace=True)
food_co2e = food_co2e[food_co2e['Year']>1989]
food_co2e = food_co2e[food_co2e['Year'] < 2015]
food_co2e.to_csv('../data/new_cleaned/food_co2e.csv')
food_co2e

           Entity  Year  Food Emissions
0     Afghanistan  1990      10442724.8
1     Afghanistan  1991      10665824.8
2     Afghanistan  1992      10805724.8
3     Afghanistan  1993      11003824.8
4     Afghanistan  1994      11286224.8
...           ...   ...             ...
5818     Zimbabwe  2010      55244889.2
5819     Zimbabwe  2011      53985614.6
5820     Zimbabwe  2012      54211027.7
5821     Zimbabwe  2013      54321218.5
5822     Zimbabwe  2014      51674911.7

[5600 rows x 3 columns]

In [8]:
ozone = pd.read_csv('../p5/data/consumption-of-ozone-depleting-substances.csv')
ozone.drop(columns=['Code'], inplace=True)
ozone.rename(columns={"Consumption of Ozone-Depleting Substances - All":"Consumption of Ozone"}, inplace=True)
ozone = ozone[ozone['Year']>1989]
ozone = ozone[ozone['Year'] < 2015]
ozone.to_csv('../data/new_cleaned/ozone.csv')
ozone

           Entity  Year  Consumption of Ozone
1     Afghanistan  1991                  0.00
2     Afghanistan  1995                381.90
3     Afghanistan  1996                381.90
4     Afghanistan  1997                381.90
5     Afghanistan  1998                  0.90
...           ...   ...                   ...
4728     Zimbabwe  2010                 29.30
4729     Zimbabwe  2011                 22.22
4730     Zimbabwe  2012                 16.20
4731     Zimbabwe  2013                 15.76
4732     Zimbabwe  2014                 13.32

[4525 rows x 3 columns]

In [9]:
transport = pd.read_csv('../p5/data/co2-emissions-transport.csv')
transport.drop(columns=['Code'], inplace=True)
transport.rename(columns={"Transport (CAIT, 2020)":"Transport"}, inplace=True)
transport = transport[transport['Year']>1989]
transport = transport[transport['Year'] < 2015]
transport = transport[transport['Entity'] != 'World']
transport = transport[transport['Entity'] != 'European Union (27)']
transport.to_csv('../data/new_cleaned/transport.csv')
transport

        Entity  Year  Transport
0      Albania  1990   700000.0
1      Albania  1991   500000.0
2      Albania  1992   400000.0
3      Albania  1993   500000.0
4      Albania  1994   600000.0
...        ...   ...        ...
3708  Zimbabwe  2010  1300000.0
3709  Zimbabwe  2011  2300000.0
3710  Zimbabwe  2012  2600000.0
3711  Zimbabwe  2013  2900000.0
3712  Zimbabwe  2014  2600000.0

[3385 rows x 3 columns]

In [10]:
co2_percap = pd.read_csv('../p5/data/co-emissions-per-capita.csv')
co2_percap.drop(columns=['Code'], inplace=True)
co2_percap.rename(columns={"Annual CO2 emissions (per capita)":"CO2 Emissions Per Cap"}, inplace=True)
co2_percap = co2_percap[co2_percap['Year']>1989]
co2_percap = co2_percap[co2_percap['Year'] < 2015]
co2_percap.to_csv('../data/new_cleaned/co2_percap.csv')
co2_percap

            Entity  Year  CO2 Emissions Per Cap
41     Afghanistan  1990                 0.2097
42     Afghanistan  1991                 0.1825
43     Afghanistan  1992                 0.0952
44     Afghanistan  1993                 0.0843
45     Afghanistan  1994                 0.0751
...            ...   ...                    ...
23296     Zimbabwe  2010                 0.6205
23297     Zimbabwe  2011                 0.7557
23298     Zimbabwe  2012                 0.6011
23299     Zimbabwe  2013                 0.8866
23300     Zimbabwe  2014                 0.8763

[5706 rows x 3 columns]

In [11]:
share_co2 = pd.read_csv('../p5/data/annual-share-of-co2-emissions.csv')
share_co2.drop(columns=['Code'], inplace=True)
share_co2.rename(columns={"Share of global annual CO2 emissions":"Shared CO2 Emissions"}, inplace=True)
share_co2 = share_co2[share_co2['Year']>1989]
share_co2 = share_co2[share_co2['Year'] < 2015]
share_co2.to_csv('../data/new_cleaned/share_co2.csv')
share_co2

            Entity  Year  Shared CO2 Emissions
41     Afghanistan  1990                  0.01
42     Afghanistan  1991                  0.01
43     Afghanistan  1992                  0.01
44     Afghanistan  1993                  0.01
45     Afghanistan  1994                  0.01
...            ...   ...                   ...
23938     Zimbabwe  2010                  0.02
23939     Zimbabwe  2011                  0.03
23940     Zimbabwe  2012                  0.02
23941     Zimbabwe  2013                  0.03
23942     Zimbabwe  2014                  0.03

[5794 rows x 3 columns]

In [12]:
co2 = pd.read_csv('../p5/data/annual_country_co2.csv')
co2.drop(columns=['Code'], inplace=True)
co2.rename(columns={"Annual CO2 emissions":"CO2 Emissions"}, inplace=True)
co2 = co2[co2['Year']>1989]
co2 = co2[co2['Year'] < 2015]
co2.to_csv('../data/new_cleaned/co2.csv')
co2

            Entity  Year  CO2 Emissions
41     Afghanistan  1990        2603238
42     Afghanistan  1991        2427366
43     Afghanistan  1992        1379462
44     Afghanistan  1993        1333055
45     Afghanistan  1994        1281602
...            ...   ...            ...
23938     Zimbabwe  2010        7878316
23939     Zimbabwe  2011        9743983
23940     Zimbabwe  2012        7882889
23941     Zimbabwe  2013       11836254
23942     Zimbabwe  2014       11905687

[5794 rows x 3 columns]

In [13]:
list_data = [airpol_death_share, co2, co2_percap, food_co2e, ghg, ozone, share_co2, transport]

------------------------------

## Combining All Data

In [14]:
asdf = pd.merge(airpol_death_share, co2, on=['Year', 'Entity'])
asdf = pd.merge(asdf, co2_percap, on=['Year', 'Entity'])
asdf = pd.merge(asdf, food_co2e, on=['Year', 'Entity'])
asdf = pd.merge(asdf, ghg, on=['Year', 'Entity'])
asdf = pd.merge(asdf, ozone, on=['Year', 'Entity'])
asdf = pd.merge(asdf, share_co2, on=['Year', 'Entity'])
asdf = pd.merge(asdf, transport, on=['Year', 'Entity'])
asdf = asdf.loc[:,~asdf.columns.duplicated()]

In [15]:
asdf

,Entity,Year,Deaths %,CO2 Emissions,CO2 Emissions Per Cap,Food Emissions,Total GHG,Consumption of Ozone,Shared CO2 Emissions,Transport
0,Albania,1991,17.613636,4228256,1.2889,4011691.0,9030000.0,0.00,0.02,500000.0
1,Albania,1995,16.789055,2066496,0.6638,4861321.1,7480000.0,43.40,0.01,600000.0
2,Albania,1996,16.588451,1993216,0.6432,4569702.9,7280000.0,43.20,0.01,600000.0
3,Albania,1997,15.081361,1531552,0.4941,4431656.7,6510000.0,45.20,0.01,500000.0
4,Albania,1998,15.965796,1744064,0.5607,4344061.6,6810000.0,49.60,0.01,700000.0
...,...,...,...,...,...,...,...,...,...,...
2653,Zimbabwe,2010,9.450169,7878316,0.6205,55244889.2,66540000.0,29.30,0.02,1300000.0
2654,Zimbabwe,2011,10.053401,9743983,0.7557,53985614.6,67420000.0,22.22,0.03,2300000.0
2655,Zimbabwe,2012,10.455091,7882889,0.6011,54211027.7,67630000.0,16.20,0.02,2600000.0
2656,Zimbabwe,2013,10.691584,11836254,0.8866,54321218.5,67550000.0,15.76,0.03,2900000.0
2657,Zimbabwe,2014,10.858493,11905687,0.8763,51674911.7,66100000.0,13.32,0.03,2600000.0

In [16]:
asdf.to_csv('../data/new_cleaned/all_cleaned.csv')

-------------------------